app/Controllers/PengunjungController.php

    public function index()
    {
        $data['pengunjung'] = $this->pengunjung->findAll();
---
SELECT *
FROM `pengunjung`